; ModuleID = 'pping_kern.c'
source_filename = "pping_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.5 = type { [4 x i32]*, [4 x i32]*, [4 x i32]* }
%struct.anon.6 = type { [1 x i32]*, %struct.network_tuple*, %struct.dual_flow_state*, [16384 x i32]* }
%struct.network_tuple = type { %struct.flow_address, %struct.flow_address, i16, i8, i8 }
%struct.flow_address = type { %struct.in6_addr, i16, i16 }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.dual_flow_state = type { %struct.flow_state, %struct.flow_state }
%struct.flow_state = type { i64, i64, i64, i64, i64, i64, i64, i32, i32, i8, i8, i8, [5 x i8] }
%struct.anon.7 = type { [1 x i32]*, %struct.packet_id*, i64*, [16384 x i32]* }
%struct.packet_id = type { %struct.network_tuple, i32 }
%struct.bpf_config = type { i64, i64, i8, i8, i8, i8, i8, [3 x i8] }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2, i32 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0, i32, i32 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }

!56 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!57 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!58 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!59 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!60 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!61 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!62 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!63 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!64 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!65 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!66 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!67 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!68 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!69 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 397, baseType: !24, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "BPF_ANY", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "BPF_NOEXIST", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "BPF_EXIST", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "BPF_F_LOCK", value: 4, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 4063, baseType: !77, size: 64, elements: !78)
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !{!79, !80, !81}
!79 = !DIEnumerator(name: "BPF_F_INDEX_MASK", value: 4294967295, isUnsigned: true)
!80 = !DIEnumerator(name: "BPF_F_CURRENT_CPU", value: 4294967295, isUnsigned: true)
!81 = !DIEnumerator(name: "BPF_F_CTXLEN_MASK", value: 4503595332403200, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 4955, baseType: !24, size: 32, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_SUCCESS", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_BLACKHOLE", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNREACHABLE", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_PROHIBIT", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NOT_FWDED", value: 4, isUnsigned: true)
!89 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FWD_DISABLED", value: 5, isUnsigned: true)
!90 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNSUPP_LWT", value: 6, isUnsigned: true)
!91 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NO_NEIGH", value: 7, isUnsigned: true)
!92 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FRAG_NEEDED", value: 8, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "flow_event_source", file: !6, line: 42, baseType: !7, size: 8, elements: !94)
!94 = !{!95, !96, !97}
!95 = !DIEnumerator(name: "EVENT_SOURCE_PKT_SRC", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "EVENT_SOURCE_PKT_DEST", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "EVENT_SOURCE_GC", value: 2, isUnsigned: true)
!98 = !{!99, !100, !101, !124, !140, !130, !131, !141, !143, !144, !145}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network_tuple", file: !6, line: 89, size: 352, elements: !103)
!103 = !{!104, !136, !137, !138, !139}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !102, file: !6, line: 90, baseType: !105, size: 160)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_address", file: !6, line: 76, size: 160, elements: !106)
!106 = !{!107, !134, !135}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !105, file: !6, line: 77, baseType: !108, size: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !109, line: 33, size: 128, elements: !110)
!109 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !108, file: !109, line: 40, baseType: !112, size: 128)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !109, line: 34, size: 128, elements: !113)
!113 = !{!114, !120, !128}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !112, file: !109, line: 35, baseType: !115, size: 128)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !118)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !117, line: 21, baseType: !7)
!117 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!118 = !{!119}
!119 = !DISubrange(count: 16)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !112, file: !109, line: 37, baseType: !121, size: 128)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, elements: !126)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !123, line: 25, baseType: !124)
!123 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !117, line: 24, baseType: !125)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !{!127}
!127 = !DISubrange(count: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !112, file: !109, line: 38, baseType: !129, size: 128)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !132)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !123, line: 27, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !117, line: 27, baseType: !24)
!132 = !{!133}
!133 = !DISubrange(count: 4)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !105, file: !6, line: 78, baseType: !124, size: 16, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !105, file: !6, line: 79, baseType: !124, size: 16, offset: 144)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !102, file: !6, line: 91, baseType: !105, size: 160, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !102, file: !6, line: 92, baseType: !124, size: 16, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ipv", scope: !102, file: !6, line: 93, baseType: !116, size: 8, offset: 336)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !102, file: !6, line: 94, baseType: !116, size: 8, offset: 344)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!146 = !{!0, !147, !172, !204, !213, !231, !239, !245, !250, !288, !293, !298}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "packet_ts", scope: !2, file: !3, line: 135, type: !149, isLocal: false, isDefinition: true)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 130, size: 256, elements: !150)
!150 = !{!151, !157, !163, !167}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !3, line: 131, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 32, elements: !155)
!154 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!155 = !{!156}
!156 = !DISubrange(count: 1)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !149, file: !3, line: 132, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id", file: !6, line: 124, size: 384, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !159, file: !6, line: 125, baseType: !102, size: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !159, file: !6, line: 126, baseType: !131, size: 32, offset: 352)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !149, file: !3, line: 133, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !117, line: 31, baseType: !166)
!166 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !149, file: !3, line: 134, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 524288, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 16384)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "flow_state", scope: !2, file: !3, line: 142, type: !174, isLocal: false, isDefinition: true)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 137, size: 256, elements: !175)
!175 = !{!176, !177, !178, !203}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !3, line: 138, baseType: !152, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !174, file: !3, line: 139, baseType: !101, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !174, file: !3, line: 140, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dual_flow_state", file: !6, line: 119, size: 1152, elements: !181)
!181 = !{!182, !202}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dir1", scope: !180, file: !6, line: 120, baseType: !183, size: 576)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_state", file: !6, line: 97, size: 576, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !198}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "min_rtt", scope: !183, file: !6, line: 98, baseType: !165, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "srtt", scope: !183, file: !6, line: 99, baseType: !165, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !183, file: !6, line: 100, baseType: !165, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sent_pkts", scope: !183, file: !6, line: 101, baseType: !165, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !183, file: !6, line: 102, baseType: !165, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rec_pkts", scope: !183, file: !6, line: 103, baseType: !165, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "rec_bytes", scope: !183, file: !6, line: 104, baseType: !165, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !183, file: !6, line: 105, baseType: !131, size: 32, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "outstanding_timestamps", scope: !183, file: !6, line: 106, baseType: !131, size: 32, offset: 480)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "conn_state", scope: !183, file: !6, line: 107, baseType: !31, size: 8, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "opening_reason", scope: !183, file: !6, line: 108, baseType: !13, size: 8, offset: 520)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "has_been_timestamped", scope: !183, file: !6, line: 109, baseType: !197, size: 8, offset: 528)
!197 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !183, file: !6, line: 110, baseType: !199, size: 40, offset: 536)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 40, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 5)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dir2", scope: !180, file: !6, line: 121, baseType: !183, size: 576, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !174, file: !3, line: 141, baseType: !168, size: 64, offset: 192)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "events", scope: !2, file: !3, line: 148, type: !206, isLocal: false, isDefinition: true)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 144, size: 192, elements: !207)
!207 = !{!208, !211, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !206, file: !3, line: 145, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !132)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !206, file: !3, line: 146, baseType: !209, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !206, file: !3, line: 147, baseType: !209, size: 64, offset: 128)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 125, type: !215, isLocal: true, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_config", file: !6, line: 60, size: 192, elements: !218)
!218 = !{!219, !220, !222, !223, !224, !225, !226, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rate_limit", scope: !217, file: !6, line: 61, baseType: !165, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_rate", scope: !217, file: !6, line: 62, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixpoint64", file: !6, line: 14, baseType: !165)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "use_srtt", scope: !217, file: !6, line: 63, baseType: !197, size: 8, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "track_tcp", scope: !217, file: !6, line: 64, baseType: !197, size: 8, offset: 136)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "track_icmp", scope: !217, file: !6, line: 65, baseType: !197, size: 8, offset: 144)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "localfilt", scope: !217, file: !6, line: 66, baseType: !197, size: 8, offset: 152)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "skip_syn", scope: !217, file: !6, line: 67, baseType: !197, size: 8, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !217, file: !6, line: 68, baseType: !228, size: 24, offset: 168)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 24, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 3)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !233, line: 77, type: !234, isLocal: true, isDefinition: true)
!233 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/t-hlnu/bpfex2/pping")
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!100, !99, !237, !237, !165}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "last_warn_time", scope: !2, file: !3, line: 126, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 128, elements: !243)
!242 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !165)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "bpf_perf_event_output", scope: !2, file: !233, line: 692, type: !247, isLocal: true, isDefinition: true)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!100, !99, !99, !165, !99, !165}
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !233, line: 1839, type: !252, isLocal: true, isDefinition: true)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!100, !99, !255, !154, !131}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !23, line: 4967, size: 512, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !270, !276, !281, !282, !283, !287}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !256, file: !23, line: 4971, baseType: !116, size: 8)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !256, file: !23, line: 4974, baseType: !116, size: 8, offset: 8)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !256, file: !23, line: 4975, baseType: !122, size: 16, offset: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !256, file: !23, line: 4976, baseType: !122, size: 16, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !256, file: !23, line: 4979, baseType: !124, size: 16, offset: 48)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !256, file: !23, line: 4984, baseType: !131, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !23, line: 4986, baseType: !265, size: 32, offset: 96)
!265 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !23, line: 4986, size: 32, elements: !266)
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !265, file: !23, line: 4988, baseType: !116, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !265, file: !23, line: 4989, baseType: !130, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !265, file: !23, line: 4992, baseType: !131, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !23, line: 4995, baseType: !271, size: 128, offset: 128)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !23, line: 4995, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !271, file: !23, line: 4996, baseType: !130, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !271, file: !23, line: 4997, baseType: !275, size: 128)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, elements: !132)
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !23, line: 5004, baseType: !277, size: 128, offset: 256)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !23, line: 5004, size: 128, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !277, file: !23, line: 5005, baseType: !130, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !277, file: !23, line: 5006, baseType: !275, size: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !256, file: !23, line: 5010, baseType: !122, size: 16, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !256, file: !23, line: 5011, baseType: !122, size: 16, offset: 400)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !256, file: !23, line: 5012, baseType: !284, size: 48, offset: 416)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 48, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 6)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !256, file: !23, line: 5013, baseType: !284, size: 48, offset: 464)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !233, line: 113, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!165}
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !233, line: 55, type: !295, isLocal: true, isDefinition: true)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!99, !99, !237}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !233, line: 87, type: !300, isLocal: true, isDefinition: true)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!100, !99, !237}
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !132)
!304 = !{i32 7, !"Dwarf Version", i32 4}
!305 = !{i32 2, !"Debug Info Version", i32 3}
!306 = !{i32 1, !"wchar_size", i32 4}
!307 = !{!"Ubuntu clang version 12.0.0-3ubuntu1~20.04.5"}
!308 = distinct !DISubprogram(name: "parse_packet_identifer_tc", scope: !3, file: !3, line: 572, type: !309, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!309 = !DISubroutineType(types: !310)
!310 = !{!154, !311, !399}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !23, line: 4183, size: 1472, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !373, !374, !375, !376, !398}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !312, file: !23, line: 4184, baseType: !131, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !312, file: !23, line: 4185, baseType: !131, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !312, file: !23, line: 4186, baseType: !131, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !312, file: !23, line: 4187, baseType: !131, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !312, file: !23, line: 4188, baseType: !131, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !312, file: !23, line: 4189, baseType: !131, size: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !312, file: !23, line: 4190, baseType: !131, size: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !312, file: !23, line: 4191, baseType: !131, size: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !312, file: !23, line: 4192, baseType: !131, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !312, file: !23, line: 4193, baseType: !131, size: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !312, file: !23, line: 4194, baseType: !131, size: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !312, file: !23, line: 4195, baseType: !131, size: 32, offset: 352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !312, file: !23, line: 4196, baseType: !327, size: 160, offset: 384)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 160, elements: !200)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !312, file: !23, line: 4197, baseType: !131, size: 32, offset: 544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !312, file: !23, line: 4198, baseType: !131, size: 32, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !23, line: 4199, baseType: !131, size: 32, offset: 608)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !312, file: !23, line: 4200, baseType: !131, size: 32, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !312, file: !23, line: 4201, baseType: !131, size: 32, offset: 672)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !312, file: !23, line: 4204, baseType: !131, size: 32, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !312, file: !23, line: 4205, baseType: !131, size: 32, offset: 736)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !312, file: !23, line: 4206, baseType: !131, size: 32, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !312, file: !23, line: 4207, baseType: !275, size: 128, offset: 800)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !312, file: !23, line: 4208, baseType: !275, size: 128, offset: 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !312, file: !23, line: 4209, baseType: !131, size: 32, offset: 1056)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !312, file: !23, line: 4210, baseType: !131, size: 32, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !312, file: !23, line: 4213, baseType: !131, size: 32, offset: 1120)
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !312, file: !23, line: 4214, baseType: !342, size: 64, align: 64, offset: 1152)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !312, file: !23, line: 4214, size: 64, align: 64, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !342, file: !23, line: 4214, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !23, line: 5041, size: 448, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !371, !372}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !346, file: !23, line: 5042, baseType: !124, size: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !346, file: !23, line: 5043, baseType: !124, size: 16, offset: 16)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !346, file: !23, line: 5044, baseType: !124, size: 16, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !346, file: !23, line: 5045, baseType: !116, size: 8, offset: 48)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !346, file: !23, line: 5046, baseType: !116, size: 8, offset: 56)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !346, file: !23, line: 5047, baseType: !116, size: 8, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !346, file: !23, line: 5048, baseType: !116, size: 8, offset: 72)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !346, file: !23, line: 5049, baseType: !122, size: 16, offset: 80)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !346, file: !23, line: 5050, baseType: !122, size: 16, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !346, file: !23, line: 5051, baseType: !122, size: 16, offset: 112)
!358 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !23, line: 5052, baseType: !359, size: 256, offset: 128)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !346, file: !23, line: 5052, size: 256, elements: !360)
!360 = !{!361, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !23, line: 5053, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !23, line: 5053, size: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !362, file: !23, line: 5054, baseType: !130, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !362, file: !23, line: 5055, baseType: !130, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !23, line: 5057, baseType: !367, size: 256)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !23, line: 5057, size: 256, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !367, file: !23, line: 5058, baseType: !275, size: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !367, file: !23, line: 5059, baseType: !275, size: 128, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !23, line: 5062, baseType: !131, size: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !346, file: !23, line: 5063, baseType: !130, size: 32, offset: 416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !312, file: !23, line: 4215, baseType: !165, size: 64, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !312, file: !23, line: 4216, baseType: !131, size: 32, offset: 1280)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !312, file: !23, line: 4217, baseType: !131, size: 32, offset: 1312)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !312, file: !23, line: 4218, baseType: !377, size: 64, align: 64, offset: 1344)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !312, file: !23, line: 4218, size: 64, align: 64, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !377, file: !23, line: 4218, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !23, line: 4272, size: 640, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !381, file: !23, line: 4273, baseType: !131, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !381, file: !23, line: 4274, baseType: !131, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !23, line: 4275, baseType: !131, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !381, file: !23, line: 4276, baseType: !131, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !381, file: !23, line: 4277, baseType: !131, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !381, file: !23, line: 4278, baseType: !131, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !381, file: !23, line: 4280, baseType: !131, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !381, file: !23, line: 4281, baseType: !275, size: 128, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !381, file: !23, line: 4282, baseType: !131, size: 32, offset: 352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !381, file: !23, line: 4283, baseType: !131, size: 32, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !381, file: !23, line: 4284, baseType: !131, size: 32, offset: 416)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !381, file: !23, line: 4285, baseType: !275, size: 128, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !381, file: !23, line: 4286, baseType: !131, size: 32, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !381, file: !23, line: 4287, baseType: !397, size: 32, offset: 608)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !117, line: 26, baseType: !154)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !312, file: !23, line: 4219, baseType: !131, size: 32, offset: 1408)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_info", file: !3, line: 90, size: 1024, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !412, !413, !414, !415, !416, !417, !418, !419}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !400, file: !3, line: 91, baseType: !165, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !400, file: !3, line: 92, baseType: !131, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !400, file: !3, line: 93, baseType: !159, size: 384, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid", scope: !400, file: !3, line: 94, baseType: !159, size: 384, offset: 480)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !400, file: !3, line: 95, baseType: !131, size: 32, offset: 864)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !400, file: !3, line: 99, baseType: !408, size: 32, offset: 896)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !3, line: 96, size: 32, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_tos", scope: !408, file: !3, line: 97, baseType: !116, size: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_tos", scope: !408, file: !3, line: 98, baseType: !130, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !400, file: !3, line: 100, baseType: !124, size: 16, offset: 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "is_ingress", scope: !400, file: !3, line: 101, baseType: !197, size: 8, offset: 944)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pid_flow_is_dfkey", scope: !400, file: !3, line: 102, baseType: !197, size: 8, offset: 952)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pid_valid", scope: !400, file: !3, line: 103, baseType: !197, size: 8, offset: 960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid_valid", scope: !400, file: !3, line: 104, baseType: !197, size: 8, offset: 968)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !400, file: !3, line: 105, baseType: !5, size: 8, offset: 976)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "event_reason", scope: !400, file: !3, line: 106, baseType: !13, size: 8, offset: 984)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "wait_first_edge", scope: !400, file: !3, line: 107, baseType: !197, size: 8, offset: 992)
!420 = !{!421, !422, !423}
!421 = !DILocalVariable(name: "ctx", arg: 1, scope: !308, file: !3, line: 572, type: !311)
!422 = !DILocalVariable(name: "p_info", arg: 2, scope: !308, file: !3, line: 573, type: !399)
!423 = !DILocalVariable(name: "pctx", scope: !308, file: !3, line: 578, type: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsing_context", file: !3, line: 72, size: 256, elements: !425)
!425 = !{!426, !427, !428, !433}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !424, file: !3, line: 73, baseType: !99, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !424, file: !3, line: 74, baseType: !99, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nh", scope: !424, file: !3, line: 75, baseType: !429, size: 64, offset: 128)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !430, line: 35, size: 64, elements: !431)
!430 = !DIFile(filename: "../lib/../include/xdp/parsing_helpers.h", directory: "/home/t-hlnu/bpfex2/pping")
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !429, file: !430, line: 36, baseType: !99, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_len", scope: !424, file: !3, line: 76, baseType: !131, size: 32, offset: 192)
!434 = !DILocation(line: 0, scope: !308)
!435 = !DILocation(line: 575, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !308, file: !3, line: 575, column: 6)
!437 = !DILocation(line: 575, column: 6, scope: !308)
!438 = !DILocation(line: 578, column: 2, scope: !308)
!439 = !DILocation(line: 578, column: 25, scope: !308)
!440 = !DILocation(line: 578, column: 32, scope: !308)
!441 = !DILocation(line: 579, column: 30, scope: !308)
!442 = !{!443, !444, i64 76}
!443 = !{!"__sk_buff", !444, i64 0, !444, i64 4, !444, i64 8, !444, i64 12, !444, i64 16, !444, i64 20, !444, i64 24, !444, i64 28, !444, i64 32, !444, i64 36, !444, i64 40, !444, i64 44, !445, i64 48, !444, i64 68, !444, i64 72, !444, i64 76, !444, i64 80, !444, i64 84, !444, i64 88, !444, i64 92, !444, i64 96, !445, i64 100, !445, i64 116, !444, i64 132, !444, i64 136, !444, i64 140, !445, i64 144, !447, i64 152, !444, i64 160, !444, i64 164, !445, i64 168, !444, i64 176}
!444 = !{!"int", !445, i64 0}
!445 = !{!"omnipotent char", !446, i64 0}
!446 = !{!"Simple C/C++ TBAA"}
!447 = !{!"long long", !445, i64 0}
!448 = !DILocation(line: 579, column: 19, scope: !308)
!449 = !DILocation(line: 579, column: 11, scope: !308)
!450 = !{!451, !452, i64 0}
!451 = !{!"parsing_context", !452, i64 0, !452, i64 8, !453, i64 16, !444, i64 24}
!452 = !{!"any pointer", !445, i64 0}
!453 = !{!"hdr_cursor", !452, i64 0}
!454 = !DILocation(line: 580, column: 34, scope: !308)
!455 = !{!443, !444, i64 80}
!456 = !DILocation(line: 580, column: 23, scope: !308)
!457 = !DILocation(line: 580, column: 15, scope: !308)
!458 = !{!451, !452, i64 8}
!459 = !DILocation(line: 581, column: 9, scope: !308)
!460 = !{!453, !452, i64 0}
!461 = !DILocation(line: 582, column: 19, scope: !308)
!462 = !{!443, !444, i64 0}
!463 = !{!451, !444, i64 24}
!464 = !DILocation(line: 585, column: 9, scope: !308)
!465 = !DILocation(line: 586, column: 1, scope: !308)
!466 = distinct !DISubprogram(name: "parse_packet_identifier", scope: !3, file: !3, line: 477, type: !467, scopeLine: 479, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !470)
!467 = !DISubroutineType(types: !468)
!468 = !{!154, !469, !399}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!470 = !{!471, !472, !473, !474, !475, !484, !494, !527}
!471 = !DILocalVariable(name: "pctx", arg: 1, scope: !466, file: !3, line: 477, type: !469)
!472 = !DILocalVariable(name: "p_info", arg: 2, scope: !466, file: !3, line: 478, type: !399)
!473 = !DILocalVariable(name: "proto", scope: !466, file: !3, line: 480, type: !154)
!474 = !DILocalVariable(name: "err", scope: !466, file: !3, line: 480, type: !154)
!475 = !DILocalVariable(name: "eth", scope: !466, file: !3, line: 481, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !478, line: 163, size: 112, elements: !479)
!478 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!479 = !{!480, !482, !483}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !477, file: !478, line: 164, baseType: !481, size: 48)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !285)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !477, file: !478, line: 165, baseType: !481, size: 48, offset: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !477, file: !478, line: 166, baseType: !122, size: 16, offset: 96)
!484 = !DILocalVariable(name: "proto_info", scope: !466, file: !3, line: 482, type: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "protocol_info", file: !3, line: 113, size: 128, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !485, file: !3, line: 114, baseType: !131, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid", scope: !485, file: !3, line: 115, baseType: !131, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pid_valid", scope: !485, file: !3, line: 116, baseType: !197, size: 8, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid_valid", scope: !485, file: !3, line: 117, baseType: !197, size: 8, offset: 72)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !485, file: !3, line: 118, baseType: !5, size: 8, offset: 80)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "event_reason", scope: !485, file: !3, line: 119, baseType: !13, size: 8, offset: 88)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "wait_first_edge", scope: !485, file: !3, line: 120, baseType: !197, size: 8, offset: 96)
!494 = !DILocalVariable(name: "iph_ptr", scope: !466, file: !3, line: 486, type: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !466, file: !3, line: 483, size: 64, elements: !496)
!496 = !{!497, !514}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "iph", scope: !495, file: !3, line: 484, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !500, line: 86, size: 160, elements: !501)
!500 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !512, !513}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !499, file: !500, line: 88, baseType: !116, size: 4, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !499, file: !500, line: 89, baseType: !116, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !499, file: !500, line: 96, baseType: !116, size: 8, offset: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !499, file: !500, line: 97, baseType: !122, size: 16, offset: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !499, file: !500, line: 98, baseType: !122, size: 16, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !499, file: !500, line: 99, baseType: !122, size: 16, offset: 48)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !499, file: !500, line: 100, baseType: !116, size: 8, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !499, file: !500, line: 101, baseType: !116, size: 8, offset: 72)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !499, file: !500, line: 102, baseType: !511, size: 16, offset: 80)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !123, line: 31, baseType: !124)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !499, file: !500, line: 103, baseType: !130, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !499, file: !500, line: 104, baseType: !130, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ip6h", scope: !495, file: !3, line: 485, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !517, line: 116, size: 320, elements: !518)
!517 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !516, file: !517, line: 118, baseType: !116, size: 4, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !516, file: !517, line: 119, baseType: !116, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !516, file: !517, line: 126, baseType: !228, size: 24, offset: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !516, file: !517, line: 128, baseType: !122, size: 16, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !516, file: !517, line: 129, baseType: !116, size: 8, offset: 48)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !516, file: !517, line: 130, baseType: !116, size: 8, offset: 56)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !516, file: !517, line: 132, baseType: !108, size: 128, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !516, file: !517, line: 133, baseType: !108, size: 128, offset: 192)
!527 = !DILocalVariable(name: "transporth_ptr", scope: !466, file: !3, line: 491, type: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !466, file: !3, line: 487, size: 64, elements: !529)
!529 = !{!530, !552, !576}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tcph", scope: !528, file: !3, line: 488, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !533, line: 25, size: 160, elements: !534)
!533 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !532, file: !533, line: 26, baseType: !122, size: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !532, file: !533, line: 27, baseType: !122, size: 16, offset: 16)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !532, file: !533, line: 28, baseType: !130, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !532, file: !533, line: 29, baseType: !130, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !532, file: !533, line: 31, baseType: !124, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !532, file: !533, line: 32, baseType: !124, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !532, file: !533, line: 33, baseType: !124, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !532, file: !533, line: 34, baseType: !124, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !532, file: !533, line: 35, baseType: !124, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !532, file: !533, line: 36, baseType: !124, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !532, file: !533, line: 37, baseType: !124, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !532, file: !533, line: 38, baseType: !124, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !532, file: !533, line: 39, baseType: !124, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !532, file: !533, line: 40, baseType: !124, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !532, file: !533, line: 55, baseType: !122, size: 16, offset: 112)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !532, file: !533, line: 56, baseType: !511, size: 16, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !532, file: !533, line: 57, baseType: !122, size: 16, offset: 144)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "icmph", scope: !528, file: !3, line: 489, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !555, line: 69, size: 64, elements: !556)
!555 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "")
!556 = !{!557, !558, !559, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !554, file: !555, line: 70, baseType: !116, size: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !554, file: !555, line: 71, baseType: !116, size: 8, offset: 8)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !554, file: !555, line: 72, baseType: !511, size: 16, offset: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !554, file: !555, line: 84, baseType: !561, size: 32, offset: 32)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !554, file: !555, line: 73, size: 32, elements: !562)
!562 = !{!563, !568, !569, !574}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !561, file: !555, line: 77, baseType: !564, size: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !555, line: 74, size: 32, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !564, file: !555, line: 75, baseType: !122, size: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !564, file: !555, line: 76, baseType: !122, size: 16, offset: 16)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !561, file: !555, line: 78, baseType: !130, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !561, file: !555, line: 82, baseType: !570, size: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !555, line: 79, size: 32, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !570, file: !555, line: 80, baseType: !122, size: 16)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !570, file: !555, line: 81, baseType: !122, size: 16, offset: 16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !561, file: !555, line: 83, baseType: !575, size: 32)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 32, elements: !132)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6h", scope: !528, file: !3, line: 490, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !579, line: 8, size: 64, elements: !580)
!579 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "")
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !578, file: !579, line: 10, baseType: !116, size: 8)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !578, file: !579, line: 11, baseType: !116, size: 8, offset: 8)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !578, file: !579, line: 12, baseType: !511, size: 16, offset: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !578, file: !579, line: 63, baseType: !585, size: 32, offset: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !578, file: !579, line: 15, size: 32, elements: !586)
!586 = !{!587, !589, !591, !592, !597, !605}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !585, file: !579, line: 16, baseType: !588, size: 32)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 32, elements: !155)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !585, file: !579, line: 17, baseType: !590, size: 32)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 32, elements: !243)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !585, file: !579, line: 18, baseType: !575, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !585, file: !579, line: 23, baseType: !593, size: 32)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !579, line: 20, size: 32, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !593, file: !579, line: 21, baseType: !122, size: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !593, file: !579, line: 22, baseType: !122, size: 16, offset: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !585, file: !579, line: 40, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !579, line: 25, size: 32, elements: !599)
!599 = !{!600, !601, !602, !603, !604}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !598, file: !579, line: 27, baseType: !131, size: 5, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !598, file: !579, line: 28, baseType: !131, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !598, file: !579, line: 29, baseType: !131, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !598, file: !579, line: 30, baseType: !131, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !598, file: !579, line: 31, baseType: !131, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !585, file: !579, line: 61, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !579, line: 42, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !606, file: !579, line: 43, baseType: !116, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !606, file: !579, line: 45, baseType: !116, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !606, file: !579, line: 46, baseType: !116, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !606, file: !579, line: 47, baseType: !116, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !606, file: !579, line: 48, baseType: !116, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !606, file: !579, line: 49, baseType: !116, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !606, file: !579, line: 60, baseType: !122, size: 16, offset: 16)
!615 = !DILocation(line: 482, column: 23, scope: !466)
!616 = !DILocation(line: 0, scope: !466)
!617 = !DILocation(line: 493, column: 17, scope: !466)
!618 = !DILocation(line: 493, column: 10, scope: !466)
!619 = !DILocation(line: 493, column: 15, scope: !466)
!620 = !{!621, !447, i64 0}
!621 = !{!"packet_info", !447, i64 0, !444, i64 8, !622, i64 12, !622, i64 60, !444, i64 108, !445, i64 112, !626, i64 116, !627, i64 118, !627, i64 119, !627, i64 120, !627, i64 121, !445, i64 122, !445, i64 123, !627, i64 124}
!622 = !{!"packet_id", !623, i64 0, !444, i64 44}
!623 = !{!"network_tuple", !624, i64 0, !624, i64 20, !626, i64 40, !445, i64 42, !445, i64 43}
!624 = !{!"flow_address", !625, i64 0, !626, i64 16, !626, i64 18}
!625 = !{!"in6_addr", !445, i64 0}
!626 = !{!"short", !445, i64 0}
!627 = !{!"_Bool", !445, i64 0}
!628 = !DILocation(line: 494, column: 40, scope: !466)
!629 = !DILocalVariable(name: "nh", arg: 1, scope: !630, file: !430, line: 131, type: !633)
!630 = distinct !DISubprogram(name: "parse_ethhdr", scope: !430, file: !430, line: 131, type: !631, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !635)
!631 = !DISubroutineType(types: !632)
!632 = !{!154, !633, !99, !634}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!635 = !{!629, !636, !637}
!636 = !DILocalVariable(name: "data_end", arg: 2, scope: !630, file: !430, line: 132, type: !99)
!637 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !630, file: !430, line: 133, type: !634)
!638 = !DILocation(line: 0, scope: !630, inlinedAt: !639)
!639 = distinct !DILocation(line: 494, column: 10, scope: !466)
!640 = !DILocalVariable(name: "nh", arg: 1, scope: !641, file: !430, line: 86, type: !633)
!641 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !430, file: !430, line: 86, type: !642, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !649)
!642 = !DISubroutineType(types: !643)
!643 = !{!154, !633, !99, !634, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !430, line: 71, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !645, file: !430, line: 72, baseType: !648, size: 32)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !243)
!649 = !{!640, !650, !651, !652, !653, !654, !655, !661, !662}
!650 = !DILocalVariable(name: "data_end", arg: 2, scope: !641, file: !430, line: 87, type: !99)
!651 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !641, file: !430, line: 88, type: !634)
!652 = !DILocalVariable(name: "vlans", arg: 4, scope: !641, file: !430, line: 89, type: !644)
!653 = !DILocalVariable(name: "eth", scope: !641, file: !430, line: 91, type: !476)
!654 = !DILocalVariable(name: "hdrsize", scope: !641, file: !430, line: 92, type: !154)
!655 = !DILocalVariable(name: "vlh", scope: !641, file: !430, line: 93, type: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !430, line: 44, size: 32, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !657, file: !430, line: 45, baseType: !122, size: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !657, file: !430, line: 46, baseType: !122, size: 16, offset: 16)
!661 = !DILocalVariable(name: "h_proto", scope: !641, file: !430, line: 94, type: !124)
!662 = !DILocalVariable(name: "i", scope: !641, file: !430, line: 95, type: !154)
!663 = !DILocation(line: 0, scope: !641, inlinedAt: !664)
!664 = distinct !DILocation(line: 136, column: 9, scope: !630, inlinedAt: !639)
!665 = !DILocation(line: 91, column: 27, scope: !641, inlinedAt: !664)
!666 = !DILocation(line: 100, column: 14, scope: !667, inlinedAt: !664)
!667 = distinct !DILexicalBlock(scope: !641, file: !430, line: 100, column: 6)
!668 = !DILocation(line: 100, column: 24, scope: !667, inlinedAt: !664)
!669 = !DILocation(line: 100, column: 6, scope: !641, inlinedAt: !664)
!670 = !DILocation(line: 106, column: 17, scope: !641, inlinedAt: !664)
!671 = !{!626, !626, i64 0}
!672 = !DILocation(line: 112, column: 2, scope: !673, inlinedAt: !664)
!673 = distinct !DILexicalBlock(scope: !641, file: !430, line: 112, column: 2)
!674 = !DILocation(line: 113, column: 7, scope: !675, inlinedAt: !664)
!675 = distinct !DILexicalBlock(scope: !676, file: !430, line: 112, column: 39)
!676 = distinct !DILexicalBlock(scope: !673, file: !430, line: 112, column: 2)
!677 = !DILocation(line: 116, column: 11, scope: !678, inlinedAt: !664)
!678 = distinct !DILexicalBlock(scope: !675, file: !430, line: 116, column: 7)
!679 = !DILocation(line: 116, column: 15, scope: !678, inlinedAt: !664)
!680 = !DILocation(line: 116, column: 7, scope: !675, inlinedAt: !664)
!681 = !DILocation(line: 119, column: 18, scope: !675, inlinedAt: !664)
!682 = !DILocation(line: 127, column: 10, scope: !641, inlinedAt: !664)
!683 = !DILocation(line: 497, column: 6, scope: !466)
!684 = !DILocation(line: 498, column: 20, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !3, line: 497, column: 36)
!686 = distinct !DILexicalBlock(scope: !466, file: !3, line: 497, column: 6)
!687 = !DILocation(line: 498, column: 24, scope: !685)
!688 = !{!621, !445, i64 54}
!689 = !DILocalVariable(name: "nh", arg: 1, scope: !690, file: !430, line: 196, type: !633)
!690 = distinct !DISubprogram(name: "parse_iphdr", scope: !430, file: !430, line: 196, type: !691, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !694)
!691 = !DISubroutineType(types: !692)
!692 = !{!154, !633, !99, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!694 = !{!689, !695, !696, !697, !698}
!695 = !DILocalVariable(name: "data_end", arg: 2, scope: !690, file: !430, line: 197, type: !99)
!696 = !DILocalVariable(name: "iphdr", arg: 3, scope: !690, file: !430, line: 198, type: !693)
!697 = !DILocalVariable(name: "iph", scope: !690, file: !430, line: 200, type: !498)
!698 = !DILocalVariable(name: "hdrsize", scope: !690, file: !430, line: 201, type: !154)
!699 = !DILocation(line: 0, scope: !690, inlinedAt: !700)
!700 = distinct !DILocation(line: 500, column: 4, scope: !685)
!701 = !DILocation(line: 203, column: 10, scope: !702, inlinedAt: !700)
!702 = distinct !DILexicalBlock(scope: !690, file: !430, line: 203, column: 6)
!703 = !DILocation(line: 203, column: 14, scope: !702, inlinedAt: !700)
!704 = !DILocation(line: 203, column: 6, scope: !690, inlinedAt: !700)
!705 = !DILocation(line: 206, column: 11, scope: !706, inlinedAt: !700)
!706 = distinct !DILexicalBlock(scope: !690, file: !430, line: 206, column: 6)
!707 = !DILocation(line: 206, column: 19, scope: !706, inlinedAt: !700)
!708 = !DILocation(line: 206, column: 6, scope: !690, inlinedAt: !700)
!709 = !DILocation(line: 209, column: 21, scope: !690, inlinedAt: !700)
!710 = !DILocation(line: 211, column: 13, scope: !711, inlinedAt: !700)
!711 = distinct !DILexicalBlock(scope: !690, file: !430, line: 211, column: 5)
!712 = !DILocation(line: 211, column: 5, scope: !690, inlinedAt: !700)
!713 = !DILocation(line: 215, column: 14, scope: !714, inlinedAt: !700)
!714 = distinct !DILexicalBlock(scope: !690, file: !430, line: 215, column: 6)
!715 = !DILocation(line: 215, column: 24, scope: !714, inlinedAt: !700)
!716 = !DILocation(line: 215, column: 6, scope: !690, inlinedAt: !700)
!717 = !DILocation(line: 218, column: 10, scope: !690, inlinedAt: !700)
!718 = !DILocation(line: 219, column: 9, scope: !690, inlinedAt: !700)
!719 = !DILocation(line: 221, column: 14, scope: !690, inlinedAt: !700)
!720 = !{!721, !445, i64 9}
!721 = !{!"iphdr", !445, i64 0, !445, i64 0, !445, i64 1, !626, i64 2, !626, i64 4, !626, i64 6, !445, i64 8, !445, i64 9, !626, i64 10, !444, i64 12, !444, i64 16}
!722 = !DILocation(line: 221, column: 9, scope: !690, inlinedAt: !700)
!723 = !DILocation(line: 221, column: 2, scope: !690, inlinedAt: !700)
!724 = !DILocation(line: 502, column: 20, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !3, line: 501, column: 45)
!726 = distinct !DILexicalBlock(scope: !686, file: !3, line: 501, column: 13)
!727 = !DILocation(line: 502, column: 24, scope: !725)
!728 = !DILocalVariable(name: "nh", arg: 1, scope: !729, file: !430, line: 174, type: !633)
!729 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !430, file: !430, line: 174, type: !730, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !733)
!730 = !DISubroutineType(types: !731)
!731 = !{!154, !633, !99, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!733 = !{!728, !734, !735, !736}
!734 = !DILocalVariable(name: "data_end", arg: 2, scope: !729, file: !430, line: 175, type: !99)
!735 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !729, file: !430, line: 176, type: !732)
!736 = !DILocalVariable(name: "ip6h", scope: !729, file: !430, line: 178, type: !515)
!737 = !DILocation(line: 0, scope: !729, inlinedAt: !738)
!738 = distinct !DILocation(line: 504, column: 4, scope: !725)
!739 = !DILocation(line: 184, column: 11, scope: !740, inlinedAt: !738)
!740 = distinct !DILexicalBlock(scope: !729, file: !430, line: 184, column: 6)
!741 = !DILocation(line: 184, column: 15, scope: !740, inlinedAt: !738)
!742 = !DILocation(line: 184, column: 6, scope: !729, inlinedAt: !738)
!743 = !DILocation(line: 187, column: 12, scope: !744, inlinedAt: !738)
!744 = distinct !DILexicalBlock(scope: !729, file: !430, line: 187, column: 6)
!745 = !DILocation(line: 187, column: 20, scope: !744, inlinedAt: !738)
!746 = !DILocation(line: 187, column: 6, scope: !729, inlinedAt: !738)
!747 = !DILocation(line: 190, column: 10, scope: !729, inlinedAt: !738)
!748 = !DILocation(line: 191, column: 10, scope: !729, inlinedAt: !738)
!749 = !DILocation(line: 193, column: 44, scope: !729, inlinedAt: !738)
!750 = !{!751, !445, i64 6}
!751 = !{!"ipv6hdr", !445, i64 0, !445, i64 0, !445, i64 1, !626, i64 4, !445, i64 6, !445, i64 7, !625, i64 8, !625, i64 24}
!752 = !DILocalVariable(name: "nh", arg: 1, scope: !753, file: !430, line: 139, type: !633)
!753 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !430, file: !430, line: 139, type: !754, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!154, !633, !99, !116}
!756 = !{!752, !757, !758, !759, !761}
!757 = !DILocalVariable(name: "data_end", arg: 2, scope: !753, file: !430, line: 140, type: !99)
!758 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !753, file: !430, line: 141, type: !116)
!759 = !DILocalVariable(name: "i", scope: !760, file: !430, line: 143, type: !154)
!760 = distinct !DILexicalBlock(scope: !753, file: !430, line: 143, column: 2)
!761 = !DILocalVariable(name: "hdr", scope: !762, file: !430, line: 144, type: !764)
!762 = distinct !DILexicalBlock(scope: !763, file: !430, line: 143, column: 47)
!763 = distinct !DILexicalBlock(scope: !760, file: !430, line: 143, column: 2)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !517, line: 61, size: 16, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !765, file: !517, line: 62, baseType: !116, size: 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !765, file: !517, line: 63, baseType: !116, size: 8, offset: 8)
!769 = !DILocation(line: 0, scope: !753, inlinedAt: !770)
!770 = distinct !DILocation(line: 193, column: 9, scope: !729, inlinedAt: !738)
!771 = !DILocation(line: 0, scope: !760, inlinedAt: !770)
!772 = !DILocation(line: 0, scope: !762, inlinedAt: !770)
!773 = !DILocation(line: 146, column: 11, scope: !774, inlinedAt: !770)
!774 = distinct !DILexicalBlock(scope: !762, file: !430, line: 146, column: 7)
!775 = !DILocation(line: 146, column: 15, scope: !774, inlinedAt: !770)
!776 = !DILocation(line: 146, column: 7, scope: !762, inlinedAt: !770)
!777 = !DILocation(line: 149, column: 3, scope: !762, inlinedAt: !770)
!778 = !DILocation(line: 154, column: 34, scope: !779, inlinedAt: !770)
!779 = distinct !DILexicalBlock(scope: !762, file: !430, line: 149, column: 26)
!780 = !{!781, !445, i64 1}
!781 = !{!"ipv6_opt_hdr", !445, i64 0, !445, i64 1}
!782 = !DILocation(line: 154, column: 29, scope: !779, inlinedAt: !770)
!783 = !DILocation(line: 154, column: 46, scope: !779, inlinedAt: !770)
!784 = !DILocation(line: 154, column: 26, scope: !779, inlinedAt: !770)
!785 = !DILocation(line: 156, column: 4, scope: !779, inlinedAt: !770)
!786 = !DILocation(line: 158, column: 34, scope: !779, inlinedAt: !770)
!787 = !DILocation(line: 158, column: 29, scope: !779, inlinedAt: !770)
!788 = !DILocation(line: 158, column: 46, scope: !779, inlinedAt: !770)
!789 = !DILocation(line: 158, column: 26, scope: !779, inlinedAt: !770)
!790 = !DILocation(line: 160, column: 4, scope: !779, inlinedAt: !770)
!791 = !DILocation(line: 162, column: 26, scope: !779, inlinedAt: !770)
!792 = !DILocation(line: 164, column: 4, scope: !779, inlinedAt: !770)
!793 = !DILocation(line: 149, column: 11, scope: !762, inlinedAt: !770)
!794 = !DILocation(line: 167, column: 4, scope: !779, inlinedAt: !770)
!795 = !DILocation(line: 0, scope: !779, inlinedAt: !770)
!796 = !{!781, !445, i64 0}
!797 = !DILocation(line: 162, column: 12, scope: !779, inlinedAt: !770)
!798 = !DILocation(line: 158, column: 12, scope: !779, inlinedAt: !770)
!799 = !DILocation(line: 154, column: 12, scope: !779, inlinedAt: !770)
!800 = !DILocation(line: 0, scope: !686)
!801 = !{!621, !626, i64 52}
!802 = !DILocation(line: 510, column: 13, scope: !803)
!803 = distinct !DILexicalBlock(scope: !466, file: !3, line: 510, column: 6)
!804 = !{!805, !627, i64 17}
!805 = !{!"bpf_config", !447, i64 0, !447, i64 8, !627, i64 16, !627, i64 17, !627, i64 18, !627, i64 19, !627, i64 20, !445, i64 21}
!806 = !{i8 0, i8 2}
!807 = !DILocation(line: 510, column: 23, scope: !803)
!808 = !DILocation(line: 512, column: 33, scope: !803)
!809 = !DILocation(line: 513, column: 33, scope: !803)
!810 = !DILocalVariable(name: "pctx", arg: 1, scope: !811, file: !3, line: 333, type: !469)
!811 = distinct !DISubprogram(name: "parse_tcp_identifier", scope: !3, file: !3, line: 333, type: !812, scopeLine: 336, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !817)
!812 = !DISubroutineType(types: !813)
!813 = !{!154, !469, !814, !815, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!817 = !{!810, !818, !819, !820, !821, !822}
!818 = !DILocalVariable(name: "tcph", arg: 2, scope: !811, file: !3, line: 334, type: !814)
!819 = !DILocalVariable(name: "sport", arg: 3, scope: !811, file: !3, line: 334, type: !815)
!820 = !DILocalVariable(name: "dport", arg: 4, scope: !811, file: !3, line: 335, type: !815)
!821 = !DILocalVariable(name: "proto_info", arg: 5, scope: !811, file: !3, line: 335, type: !816)
!822 = !DILocalVariable(name: "hdr", scope: !811, file: !3, line: 337, type: !531)
!823 = !DILocation(line: 0, scope: !811, inlinedAt: !824)
!824 = distinct !DILocation(line: 511, column: 9, scope: !803)
!825 = !DILocalVariable(name: "nh", arg: 1, scope: !826, file: !430, line: 295, type: !633)
!826 = distinct !DISubprogram(name: "parse_tcphdr", scope: !430, file: !430, line: 295, type: !827, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!154, !633, !99, !814}
!829 = !{!825, !830, !831, !832, !833}
!830 = !DILocalVariable(name: "data_end", arg: 2, scope: !826, file: !430, line: 296, type: !99)
!831 = !DILocalVariable(name: "tcphdr", arg: 3, scope: !826, file: !430, line: 297, type: !814)
!832 = !DILocalVariable(name: "len", scope: !826, file: !430, line: 299, type: !154)
!833 = !DILocalVariable(name: "h", scope: !826, file: !430, line: 300, type: !531)
!834 = !DILocation(line: 0, scope: !826, inlinedAt: !835)
!835 = distinct !DILocation(line: 338, column: 6, scope: !836, inlinedAt: !824)
!836 = distinct !DILexicalBlock(scope: !811, file: !3, line: 338, column: 6)
!837 = !DILocation(line: 300, column: 25, scope: !826, inlinedAt: !835)
!838 = !DILocation(line: 302, column: 8, scope: !839, inlinedAt: !835)
!839 = distinct !DILexicalBlock(scope: !826, file: !430, line: 302, column: 6)
!840 = !DILocation(line: 302, column: 12, scope: !839, inlinedAt: !835)
!841 = !DILocation(line: 302, column: 6, scope: !826, inlinedAt: !835)
!842 = !DILocation(line: 305, column: 11, scope: !826, inlinedAt: !835)
!843 = !DILocation(line: 305, column: 16, scope: !826, inlinedAt: !835)
!844 = !DILocation(line: 307, column: 9, scope: !845, inlinedAt: !835)
!845 = distinct !DILexicalBlock(scope: !826, file: !430, line: 307, column: 5)
!846 = !DILocation(line: 307, column: 5, scope: !826, inlinedAt: !835)
!847 = !DILocation(line: 311, column: 14, scope: !848, inlinedAt: !835)
!848 = distinct !DILexicalBlock(scope: !826, file: !430, line: 311, column: 6)
!849 = !DILocation(line: 311, column: 20, scope: !848, inlinedAt: !835)
!850 = !DILocation(line: 311, column: 6, scope: !826, inlinedAt: !835)
!851 = !DILocation(line: 314, column: 10, scope: !826, inlinedAt: !835)
!852 = !DILocation(line: 341, column: 13, scope: !853, inlinedAt: !824)
!853 = distinct !DILexicalBlock(scope: !811, file: !3, line: 341, column: 6)
!854 = !{!805, !627, i64 20}
!855 = !DILocation(line: 341, column: 22, scope: !853, inlinedAt: !824)
!856 = !DILocalVariable(name: "tcph", arg: 1, scope: !857, file: !3, line: 274, type: !531)
!857 = distinct !DISubprogram(name: "parse_tcp_ts", scope: !3, file: !3, line: 274, type: !858, scopeLine: 276, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!154, !531, !99, !144, !144}
!860 = !{!856, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!861 = !DILocalVariable(name: "data_end", arg: 2, scope: !857, file: !3, line: 274, type: !99)
!862 = !DILocalVariable(name: "tsval", arg: 3, scope: !857, file: !3, line: 274, type: !144)
!863 = !DILocalVariable(name: "tsecr", arg: 4, scope: !857, file: !3, line: 275, type: !144)
!864 = !DILocalVariable(name: "len", scope: !857, file: !3, line: 277, type: !154)
!865 = !DILocalVariable(name: "opt_end", scope: !857, file: !3, line: 278, type: !99)
!866 = !DILocalVariable(name: "pos", scope: !857, file: !3, line: 279, type: !143)
!867 = !DILocalVariable(name: "i", scope: !857, file: !3, line: 280, type: !116)
!868 = !DILocalVariable(name: "opt", scope: !857, file: !3, line: 280, type: !116)
!869 = !DILocalVariable(name: "opt_size", scope: !857, file: !3, line: 282, type: !870)
!870 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!871 = !DILocation(line: 0, scope: !857, inlinedAt: !872)
!872 = distinct !DILocation(line: 344, column: 6, scope: !873, inlinedAt: !824)
!873 = distinct !DILexicalBlock(scope: !811, file: !3, line: 344, column: 6)
!874 = !DILocation(line: 277, column: 23, scope: !857, inlinedAt: !872)
!875 = !DILocation(line: 278, column: 31, scope: !857, inlinedAt: !872)
!876 = !DILocation(line: 281, column: 2, scope: !857, inlinedAt: !872)
!877 = !DILocation(line: 282, column: 3, scope: !857, inlinedAt: !872)
!878 = !DILocation(line: 284, column: 26, scope: !879, inlinedAt: !872)
!879 = distinct !DILexicalBlock(scope: !857, file: !3, line: 284, column: 6)
!880 = !DILocation(line: 288, column: 11, scope: !881, inlinedAt: !872)
!881 = distinct !DILexicalBlock(scope: !882, file: !3, line: 288, column: 7)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 287, column: 40)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 287, column: 2)
!884 = distinct !DILexicalBlock(scope: !857, file: !3, line: 287, column: 2)
!885 = !DILocation(line: 288, column: 15, scope: !881, inlinedAt: !872)
!886 = !DILocation(line: 288, column: 25, scope: !881, inlinedAt: !872)
!887 = !DILocation(line: 291, column: 9, scope: !882, inlinedAt: !872)
!888 = !{!445, !445, i64 0}
!889 = !DILocation(line: 292, column: 7, scope: !882, inlinedAt: !872)
!890 = !DILocation(line: 301, column: 11, scope: !891, inlinedAt: !872)
!891 = distinct !DILexicalBlock(scope: !882, file: !3, line: 301, column: 7)
!892 = !DILocation(line: 301, column: 15, scope: !891, inlinedAt: !872)
!893 = !DILocation(line: 301, column: 25, scope: !891, inlinedAt: !872)
!894 = !DILocation(line: 303, column: 14, scope: !882, inlinedAt: !872)
!895 = !DILocation(line: 303, column: 12, scope: !882, inlinedAt: !872)
!896 = !DILocation(line: 304, column: 7, scope: !897, inlinedAt: !872)
!897 = distinct !DILexicalBlock(scope: !882, file: !3, line: 304, column: 7)
!898 = !DILocation(line: 304, column: 16, scope: !897, inlinedAt: !872)
!899 = !DILocation(line: 304, column: 7, scope: !882, inlinedAt: !872)
!900 = !DILocation(line: 308, column: 11, scope: !901, inlinedAt: !872)
!901 = distinct !DILexicalBlock(scope: !882, file: !3, line: 308, column: 7)
!902 = !DILocation(line: 308, column: 16, scope: !901, inlinedAt: !872)
!903 = !DILocation(line: 308, column: 19, scope: !901, inlinedAt: !872)
!904 = !DILocation(line: 308, column: 28, scope: !901, inlinedAt: !872)
!905 = !DILocation(line: 308, column: 7, scope: !882, inlinedAt: !872)
!906 = !DILocation(line: 309, column: 12, scope: !907, inlinedAt: !872)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 309, column: 8)
!908 = distinct !DILexicalBlock(scope: !901, file: !3, line: 308, column: 35)
!909 = !DILocation(line: 309, column: 17, scope: !907, inlinedAt: !872)
!910 = !DILocation(line: 309, column: 27, scope: !907, inlinedAt: !872)
!911 = !DILocation(line: 317, column: 10, scope: !882, inlinedAt: !872)
!912 = !DILocation(line: 317, column: 7, scope: !882, inlinedAt: !872)
!913 = !DILocation(line: 318, column: 2, scope: !882, inlinedAt: !872)
!914 = !DILocation(line: 0, scope: !882, inlinedAt: !872)
!915 = !DILocation(line: 320, column: 1, scope: !857, inlinedAt: !872)
!916 = !DILocation(line: 344, column: 6, scope: !811, inlinedAt: !824)
!917 = !DILocation(line: 311, column: 13, scope: !908, inlinedAt: !872)
!918 = !{!444, !444, i64 0}
!919 = !DILocation(line: 312, column: 13, scope: !908, inlinedAt: !872)
!920 = !DILocation(line: 350, column: 24, scope: !811, inlinedAt: !824)
!921 = !DILocation(line: 350, column: 16, scope: !811, inlinedAt: !824)
!922 = !DILocation(line: 350, column: 37, scope: !811, inlinedAt: !824)
!923 = !DILocation(line: 350, column: 31, scope: !811, inlinedAt: !824)
!924 = !DILocation(line: 350, column: 29, scope: !811, inlinedAt: !824)
!925 = !DILocation(line: 350, column: 45, scope: !811, inlinedAt: !824)
!926 = !DILocation(line: 349, column: 24, scope: !811, inlinedAt: !824)
!927 = !DILocation(line: 353, column: 30, scope: !811, inlinedAt: !824)
!928 = !DILocation(line: 356, column: 6, scope: !929, inlinedAt: !824)
!929 = distinct !DILexicalBlock(scope: !811, file: !3, line: 356, column: 6)
!930 = !DILocation(line: 356, column: 6, scope: !811, inlinedAt: !824)
!931 = !DILocation(line: 359, column: 13, scope: !932, inlinedAt: !824)
!932 = distinct !DILexicalBlock(scope: !929, file: !3, line: 359, column: 13)
!933 = !DILocation(line: 359, column: 13, scope: !929, inlinedAt: !824)
!934 = !DILocation(line: 365, column: 4, scope: !935, inlinedAt: !824)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 362, column: 23)
!936 = distinct !DILexicalBlock(scope: !932, file: !3, line: 362, column: 13)
!937 = !DILocation(line: 367, column: 2, scope: !935, inlinedAt: !824)
!938 = !DILocation(line: 0, scope: !929, inlinedAt: !824)
!939 = !DILocation(line: 373, column: 16, scope: !811, inlinedAt: !824)
!940 = !{!941, !626, i64 0}
!941 = !{!"tcphdr", !626, i64 0, !626, i64 2, !444, i64 4, !444, i64 8, !626, i64 12, !626, i64 12, !626, i64 13, !626, i64 13, !626, i64 13, !626, i64 13, !626, i64 13, !626, i64 13, !626, i64 13, !626, i64 13, !626, i64 14, !626, i64 16, !626, i64 18}
!942 = !DILocation(line: 373, column: 9, scope: !811, inlinedAt: !824)
!943 = !DILocation(line: 374, column: 16, scope: !811, inlinedAt: !824)
!944 = !{!941, !626, i64 2}
!945 = !DILocation(line: 374, column: 9, scope: !811, inlinedAt: !824)
!946 = !DILocation(line: 377, column: 2, scope: !811, inlinedAt: !824)
!947 = !DILocation(line: 515, column: 18, scope: !948)
!948 = distinct !DILexicalBlock(scope: !803, file: !3, line: 515, column: 11)
!949 = !{!805, !627, i64 18}
!950 = !DILocation(line: 515, column: 29, scope: !948)
!951 = !DILocation(line: 519, column: 35, scope: !948)
!952 = !DILocation(line: 520, column: 35, scope: !948)
!953 = !DILocalVariable(name: "pctx", arg: 1, scope: !954, file: !3, line: 395, type: !469)
!954 = distinct !DISubprogram(name: "parse_icmp6_identifier", scope: !3, file: !3, line: 395, type: !955, scopeLine: 399, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !958)
!955 = !DISubroutineType(types: !956)
!956 = !{!154, !469, !957, !815, !815, !816}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!958 = !{!953, !959, !960, !961, !962, !963}
!959 = !DILocalVariable(name: "icmp6h", arg: 2, scope: !954, file: !3, line: 396, type: !957)
!960 = !DILocalVariable(name: "sport", arg: 3, scope: !954, file: !3, line: 396, type: !815)
!961 = !DILocalVariable(name: "dport", arg: 4, scope: !954, file: !3, line: 397, type: !815)
!962 = !DILocalVariable(name: "proto_info", arg: 5, scope: !954, file: !3, line: 398, type: !816)
!963 = !DILocalVariable(name: "hdr", scope: !954, file: !3, line: 400, type: !577)
!964 = !DILocation(line: 0, scope: !954, inlinedAt: !965)
!965 = distinct !DILocation(line: 518, column: 9, scope: !948)
!966 = !DILocalVariable(name: "nh", arg: 1, scope: !967, file: !430, line: 224, type: !633)
!967 = distinct !DISubprogram(name: "parse_icmp6hdr", scope: !430, file: !430, line: 224, type: !968, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!154, !633, !99, !957}
!970 = !{!966, !971, !972, !973}
!971 = !DILocalVariable(name: "data_end", arg: 2, scope: !967, file: !430, line: 225, type: !99)
!972 = !DILocalVariable(name: "icmp6hdr", arg: 3, scope: !967, file: !430, line: 226, type: !957)
!973 = !DILocalVariable(name: "icmp6h", scope: !967, file: !430, line: 228, type: !577)
!974 = !DILocation(line: 0, scope: !967, inlinedAt: !975)
!975 = distinct !DILocation(line: 401, column: 6, scope: !976, inlinedAt: !965)
!976 = distinct !DILexicalBlock(scope: !954, file: !3, line: 401, column: 6)
!977 = !DILocation(line: 230, column: 13, scope: !978, inlinedAt: !975)
!978 = distinct !DILexicalBlock(scope: !967, file: !430, line: 230, column: 6)
!979 = !DILocation(line: 230, column: 17, scope: !978, inlinedAt: !975)
!980 = !DILocation(line: 230, column: 6, scope: !967, inlinedAt: !975)
!981 = !DILocation(line: 233, column: 14, scope: !967, inlinedAt: !975)
!982 = !DILocation(line: 233, column: 12, scope: !967, inlinedAt: !975)
!983 = !DILocation(line: 404, column: 11, scope: !984, inlinedAt: !965)
!984 = distinct !DILexicalBlock(scope: !954, file: !3, line: 404, column: 6)
!985 = !{!986, !445, i64 1}
!986 = !{!"icmp6hdr", !445, i64 0, !445, i64 1, !626, i64 2, !445, i64 4}
!987 = !DILocation(line: 404, column: 22, scope: !984, inlinedAt: !965)
!988 = !DILocation(line: 404, column: 6, scope: !954, inlinedAt: !965)
!989 = !DILocation(line: 407, column: 11, scope: !990, inlinedAt: !965)
!990 = distinct !DILexicalBlock(scope: !954, file: !3, line: 407, column: 6)
!991 = !{!986, !445, i64 0}
!992 = !DILocation(line: 407, column: 6, scope: !954, inlinedAt: !965)
!993 = !DILocation(line: 408, column: 26, scope: !994, inlinedAt: !965)
!994 = distinct !DILexicalBlock(scope: !990, file: !3, line: 407, column: 46)
!995 = !DILocation(line: 408, column: 21, scope: !994, inlinedAt: !965)
!996 = !DILocation(line: 412, column: 2, scope: !994, inlinedAt: !965)
!997 = !DILocation(line: 413, column: 32, scope: !998, inlinedAt: !965)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 412, column: 51)
!999 = distinct !DILexicalBlock(scope: !990, file: !3, line: 412, column: 13)
!1000 = !DILocation(line: 413, column: 27, scope: !998, inlinedAt: !965)
!1001 = !DILocation(line: 0, scope: !990, inlinedAt: !965)
!1002 = !DILocation(line: 424, column: 16, scope: !954, inlinedAt: !965)
!1003 = !DILocation(line: 424, column: 9, scope: !954, inlinedAt: !965)
!1004 = !DILocation(line: 425, column: 16, scope: !954, inlinedAt: !965)
!1005 = !DILocation(line: 425, column: 9, scope: !954, inlinedAt: !965)
!1006 = !DILocation(line: 428, column: 2, scope: !954, inlinedAt: !965)
!1007 = !DILocation(line: 522, column: 18, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !948, file: !3, line: 522, column: 11)
!1009 = !DILocation(line: 522, column: 29, scope: !1008)
!1010 = !DILocation(line: 525, column: 34, scope: !1008)
!1011 = !DILocation(line: 526, column: 34, scope: !1008)
!1012 = !DILocalVariable(name: "pctx", arg: 1, scope: !1013, file: !3, line: 434, type: !469)
!1013 = distinct !DISubprogram(name: "parse_icmp_identifier", scope: !3, file: !3, line: 434, type: !1014, scopeLine: 437, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1017)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!154, !469, !1016, !815, !815, !816}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!1017 = !{!1012, !1018, !1019, !1020, !1021, !1022}
!1018 = !DILocalVariable(name: "icmph", arg: 2, scope: !1013, file: !3, line: 435, type: !1016)
!1019 = !DILocalVariable(name: "sport", arg: 3, scope: !1013, file: !3, line: 435, type: !815)
!1020 = !DILocalVariable(name: "dport", arg: 4, scope: !1013, file: !3, line: 436, type: !815)
!1021 = !DILocalVariable(name: "proto_info", arg: 5, scope: !1013, file: !3, line: 436, type: !816)
!1022 = !DILocalVariable(name: "hdr", scope: !1013, file: !3, line: 438, type: !553)
!1023 = !DILocation(line: 0, scope: !1013, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 524, column: 9, scope: !1008)
!1025 = !DILocalVariable(name: "nh", arg: 1, scope: !1026, file: !430, line: 239, type: !633)
!1026 = distinct !DISubprogram(name: "parse_icmphdr", scope: !430, file: !430, line: 239, type: !1027, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1029)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!154, !633, !99, !1016}
!1029 = !{!1025, !1030, !1031, !1032}
!1030 = !DILocalVariable(name: "data_end", arg: 2, scope: !1026, file: !430, line: 240, type: !99)
!1031 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !1026, file: !430, line: 241, type: !1016)
!1032 = !DILocalVariable(name: "icmph", scope: !1026, file: !430, line: 243, type: !553)
!1033 = !DILocation(line: 0, scope: !1026, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 439, column: 6, scope: !1035, inlinedAt: !1024)
!1035 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 439, column: 6)
!1036 = !DILocation(line: 245, column: 12, scope: !1037, inlinedAt: !1034)
!1037 = distinct !DILexicalBlock(scope: !1026, file: !430, line: 245, column: 6)
!1038 = !DILocation(line: 245, column: 16, scope: !1037, inlinedAt: !1034)
!1039 = !DILocation(line: 245, column: 6, scope: !1026, inlinedAt: !1034)
!1040 = !DILocation(line: 248, column: 13, scope: !1026, inlinedAt: !1034)
!1041 = !DILocation(line: 248, column: 11, scope: !1026, inlinedAt: !1034)
!1042 = !DILocation(line: 442, column: 11, scope: !1043, inlinedAt: !1024)
!1043 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 442, column: 6)
!1044 = !{!1045, !445, i64 1}
!1045 = !{!"icmphdr", !445, i64 0, !445, i64 1, !626, i64 2, !445, i64 4}
!1046 = !DILocation(line: 442, column: 16, scope: !1043, inlinedAt: !1024)
!1047 = !DILocation(line: 442, column: 6, scope: !1013, inlinedAt: !1024)
!1048 = !DILocation(line: 445, column: 11, scope: !1049, inlinedAt: !1024)
!1049 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 445, column: 6)
!1050 = !{!1045, !445, i64 0}
!1051 = !DILocation(line: 445, column: 6, scope: !1013, inlinedAt: !1024)
!1052 = !DILocation(line: 446, column: 26, scope: !1053, inlinedAt: !1024)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 445, column: 30)
!1054 = !DILocation(line: 446, column: 29, scope: !1053, inlinedAt: !1024)
!1055 = !DILocation(line: 446, column: 34, scope: !1053, inlinedAt: !1024)
!1056 = !DILocation(line: 446, column: 21, scope: !1053, inlinedAt: !1024)
!1057 = !DILocation(line: 450, column: 2, scope: !1053, inlinedAt: !1024)
!1058 = !DILocation(line: 451, column: 32, scope: !1059, inlinedAt: !1024)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 450, column: 42)
!1060 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 450, column: 13)
!1061 = !DILocation(line: 451, column: 35, scope: !1059, inlinedAt: !1024)
!1062 = !DILocation(line: 451, column: 40, scope: !1059, inlinedAt: !1024)
!1063 = !DILocation(line: 451, column: 27, scope: !1059, inlinedAt: !1024)
!1064 = !DILocation(line: 0, scope: !1049, inlinedAt: !1024)
!1065 = !DILocation(line: 462, column: 16, scope: !1013, inlinedAt: !1024)
!1066 = !DILocation(line: 462, column: 24, scope: !1013, inlinedAt: !1024)
!1067 = !DILocation(line: 462, column: 9, scope: !1013, inlinedAt: !1024)
!1068 = !DILocation(line: 463, column: 24, scope: !1013, inlinedAt: !1024)
!1069 = !DILocation(line: 463, column: 9, scope: !1013, inlinedAt: !1024)
!1070 = !DILocation(line: 466, column: 2, scope: !1013, inlinedAt: !1024)
!1071 = !DILocation(line: 534, column: 14, scope: !466)
!1072 = !DILocation(line: 534, column: 25, scope: !466)
!1073 = !{!621, !444, i64 56}
!1074 = !DILocation(line: 535, column: 10, scope: !466)
!1075 = !DILocation(line: 535, column: 20, scope: !466)
!1076 = !{!621, !627, i64 120}
!1077 = !DILocation(line: 536, column: 20, scope: !466)
!1078 = !DILocation(line: 536, column: 31, scope: !466)
!1079 = !{!621, !444, i64 104}
!1080 = !DILocation(line: 537, column: 10, scope: !466)
!1081 = !DILocation(line: 537, column: 26, scope: !466)
!1082 = !{!621, !627, i64 121}
!1083 = !DILocation(line: 538, column: 10, scope: !466)
!1084 = !DILocation(line: 538, column: 21, scope: !466)
!1085 = !{!621, !445, i64 122}
!1086 = !DILocation(line: 539, column: 10, scope: !466)
!1087 = !DILocation(line: 539, column: 23, scope: !466)
!1088 = !{!621, !445, i64 123}
!1089 = !DILocation(line: 540, column: 10, scope: !466)
!1090 = !DILocation(line: 540, column: 26, scope: !466)
!1091 = !{!621, !627, i64 124}
!1092 = !DILocation(line: 542, column: 18, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !466, file: !3, line: 542, column: 6)
!1094 = !DILocation(line: 542, column: 6, scope: !466)
!1095 = !DILocation(line: 544, column: 19, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 542, column: 39)
!1097 = !{!721, !444, i64 12}
!1098 = !DILocalVariable(name: "ipv6", arg: 1, scope: !1099, file: !3, line: 156, type: !145)
!1099 = distinct !DISubprogram(name: "map_ipv4_to_ipv6", scope: !3, file: !3, line: 156, type: !1100, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{null, !145, !130}
!1102 = !{!1098, !1103}
!1103 = !DILocalVariable(name: "ipv4", arg: 2, scope: !1099, file: !3, line: 156, type: !130)
!1104 = !DILocation(line: 0, scope: !1099, inlinedAt: !1105)
!1105 = distinct !DILocation(line: 543, column: 3, scope: !1096)
!1106 = !DILocation(line: 158, column: 32, scope: !1099, inlinedAt: !1105)
!1107 = !DILocation(line: 158, column: 20, scope: !1099, inlinedAt: !1105)
!1108 = !DILocation(line: 158, column: 2, scope: !1099, inlinedAt: !1105)
!1109 = !DILocation(line: 159, column: 20, scope: !1099, inlinedAt: !1105)
!1110 = !DILocation(line: 159, column: 2, scope: !1099, inlinedAt: !1105)
!1111 = !DILocation(line: 160, column: 2, scope: !1099, inlinedAt: !1105)
!1112 = !DILocation(line: 160, column: 27, scope: !1099, inlinedAt: !1105)
!1113 = !DILocation(line: 545, column: 44, scope: !1096)
!1114 = !DILocation(line: 546, column: 19, scope: !1096)
!1115 = !{!721, !444, i64 16}
!1116 = !DILocation(line: 0, scope: !1099, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 545, column: 3, scope: !1096)
!1118 = !DILocation(line: 158, column: 32, scope: !1099, inlinedAt: !1117)
!1119 = !DILocation(line: 158, column: 20, scope: !1099, inlinedAt: !1117)
!1120 = !DILocation(line: 158, column: 2, scope: !1099, inlinedAt: !1117)
!1121 = !DILocation(line: 159, column: 20, scope: !1099, inlinedAt: !1117)
!1122 = !DILocation(line: 159, column: 2, scope: !1099, inlinedAt: !1117)
!1123 = !DILocation(line: 160, column: 2, scope: !1099, inlinedAt: !1117)
!1124 = !DILocation(line: 160, column: 27, scope: !1099, inlinedAt: !1117)
!1125 = !DILocation(line: 547, column: 20, scope: !1096)
!1126 = !{!721, !626, i64 2}
!1127 = !DILocation(line: 548, column: 42, scope: !1096)
!1128 = !{!721, !445, i64 1}
!1129 = !DILocation(line: 548, column: 11, scope: !1096)
!1130 = !DILocation(line: 548, column: 18, scope: !1096)
!1131 = !DILocation(line: 548, column: 27, scope: !1096)
!1132 = !DILocation(line: 549, column: 2, scope: !1096)
!1133 = !DILocation(line: 550, column: 45, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 549, column: 9)
!1135 = !{i64 0, i64 16, !888, i64 0, i64 16, !888, i64 0, i64 16, !888}
!1136 = !DILocation(line: 551, column: 26, scope: !1134)
!1137 = !DILocation(line: 551, column: 45, scope: !1134)
!1138 = !DILocation(line: 552, column: 20, scope: !1134)
!1139 = !{!751, !626, i64 4}
!1140 = !DILocation(line: 554, column: 23, scope: !1134)
!1141 = !DILocation(line: 554, column: 4, scope: !1134)
!1142 = !DILocation(line: 554, column: 28, scope: !1134)
!1143 = !DILocation(line: 553, column: 18, scope: !1134)
!1144 = !DILocation(line: 553, column: 27, scope: !1134)
!1145 = !DILocation(line: 190, column: 21, scope: !1146, inlinedAt: !1152)
!1146 = distinct !DISubprogram(name: "reverse_flow", scope: !3, file: !3, line: 185, type: !1147, scopeLine: 186, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1149)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !101, !101}
!1149 = !{!1150, !1151}
!1150 = !DILocalVariable(name: "dest", arg: 1, scope: !1146, file: !3, line: 185, type: !101)
!1151 = !DILocalVariable(name: "src", arg: 2, scope: !1146, file: !3, line: 185, type: !101)
!1152 = distinct !DILocation(line: 559, column: 2, scope: !466)
!1153 = !DILocation(line: 0, scope: !1093)
!1154 = !DILocation(line: 547, column: 11, scope: !1096)
!1155 = !DILocation(line: 547, column: 18, scope: !1096)
!1156 = !DILocation(line: 557, column: 30, scope: !466)
!1157 = !DILocation(line: 557, column: 10, scope: !466)
!1158 = !DILocation(line: 557, column: 28, scope: !466)
!1159 = !{!621, !627, i64 119}
!1160 = !DILocation(line: 559, column: 34, scope: !466)
!1161 = !DILocation(line: 0, scope: !1146, inlinedAt: !1152)
!1162 = !DILocation(line: 187, column: 8, scope: !1146, inlinedAt: !1152)
!1163 = !DILocation(line: 187, column: 12, scope: !1146, inlinedAt: !1152)
!1164 = !{!623, !445, i64 42}
!1165 = !DILocation(line: 188, column: 8, scope: !1146, inlinedAt: !1152)
!1166 = !DILocation(line: 188, column: 14, scope: !1146, inlinedAt: !1152)
!1167 = !{!623, !626, i64 40}
!1168 = !DILocation(line: 189, column: 21, scope: !1146, inlinedAt: !1152)
!1169 = !{i64 0, i64 16, !888, i64 0, i64 16, !888, i64 0, i64 16, !888, i64 16, i64 2, !671, i64 18, i64 2, !671}
!1170 = !DILocation(line: 190, column: 8, scope: !1146, inlinedAt: !1152)
!1171 = !DILocation(line: 191, column: 8, scope: !1146, inlinedAt: !1152)
!1172 = !DILocation(line: 191, column: 17, scope: !1146, inlinedAt: !1152)
!1173 = !{!623, !445, i64 43}
!1174 = !DILocalVariable(name: "ctx", arg: 1, scope: !1175, file: !3, line: 171, type: !469)
!1175 = distinct !DISubprogram(name: "remaining_pkt_payload", scope: !3, file: !3, line: 171, type: !1176, scopeLine: 172, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1178)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!131, !469}
!1178 = !{!1174, !1179}
!1179 = !DILocalVariable(name: "parsed_bytes", scope: !1175, file: !3, line: 175, type: !131)
!1180 = !DILocation(line: 0, scope: !1175, inlinedAt: !1181)
!1181 = distinct !DILocation(line: 560, column: 20, scope: !466)
!1182 = !DILocation(line: 175, column: 31, scope: !1175, inlinedAt: !1181)
!1183 = !{!451, !452, i64 16}
!1184 = !DILocation(line: 175, column: 42, scope: !1175, inlinedAt: !1181)
!1185 = !DILocation(line: 175, column: 35, scope: !1175, inlinedAt: !1181)
!1186 = !DILocation(line: 175, column: 23, scope: !1175, inlinedAt: !1181)
!1187 = !DILocation(line: 176, column: 29, scope: !1175, inlinedAt: !1181)
